// - Створити змінні. Присвоїти кожному з них значення: 'hello','owu','com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16, true, false.
//     Вивести кожну змінну за допомогою: console.log , alert, document.write
// const a1 = 'hello';
// const a2 = 'owu';
// const a3 = 'com';
// const a4 = 'UA';
// const a5 = 1;
// const a6 = 10;
// const a7 = -999;
// const a8 = 123;
// const a9 = 3.14;
// const a10 = 2.7;
// const a11 = 16;
// const a12 = true;
// const a13 = false;
// console.log(`${a1} ${a2} ${a3} ${a4} ${a5} ${a6} ${a7} ${a8} ${a9} ${a10} ${a11} ${a12} ${a13}`);
// document.write(`${a1} ${a2} ${a3} ${a4} ${a5} ${a6} ${a7} ${a8} ${a9} ${a10} ${a11} ${a12} ${a13}`);
// alert(`${a1} ${a2} ${a3} ${a4} ${a5} ${a6} ${a7} ${a8} ${a9} ${a10} ${a11} ${a12} ${a13}`);

// - За допомогою 3х різних prompt() отримати 3 слова які являються вашими Імям, По-Батькові та роками.
//     Вивести "Вітаю *Імя* *По батькові*. Тобі *вік* років".
// - Взяти змінні з завдання вище та зєднати їх в одну змінну (конкатинація).
// let name =prompt('імя');
// let surname =prompt('прізвище');
// let mname =prompt('вік');
// // console.log(`${name} ${surname} ${mname}`);
// console.log(name+' '+surname+' '+mname);

// - За допомогою prompt() отримати 3 числа. Привести їх до числа (Google "String to number JS"). Вивести їх в консоль.
// - За допомогою prompt() отримати 4 числа. Привести їх до числа за допомогою paeseInt. Додати їх всі мож собою і результат вивести в консоль.
// let c1 = parseInt(prompt('1'));
// let c2 = parseInt(prompt('2'));
// let c3 = parseInt(prompt('3'));
// console.log(c1 + c2 + c3);

// - За допомогою prompt() отримати 3 числа з плаваючою точкою за допомогою parseFloat.
//     Просумувати їх. Отрманий результат записати в змінну result. Вивести цю змінну в консоль.
// let d1 = parseFloat(prompt('1'));
// let d2 = parseFloat(prompt('2'));
// let d3 = parseFloat(prompt('3'));
// result =d1+d2+d3;
// console.log(result);

// - За допомогою prompt() отримати 3 числа з плаваючою точкою. Заокруглити їх (Google "round number JS"). Просумувати їх між собою. Результат вивести в консоль.
// let f1 = Math.round(prompt('1'));
// let f2 = Math.round(prompt('2'));
// let f3 = Math.round(prompt('3'));
// console.log(f1 + f2 + f3);

// - За допомогою prompt() отримати 2 цілих числа.
//     Перше число - це число яке будуть підносити до степеня. Друге число - це число яке являється степенню.
//     За допомогою Math.pow (Google) піднести перше число в степінь другого числа.
//     Example. Число 1 = 5. Число 2 = 2. Результат = 25
// let g1 = +prompt('1');
// let g2 = +prompt('2');
// g3 = Math.pow(g1,g2);
// console.log(g3);

//     - За допомогою оператора typeof визначити типи наступних змінних та вивести їх в консоль.
// let a = 100;
// let b = '100';
// let c = true;
// console.log(`${typeof(a)} ${typeof(b)} ${typeof(c)} `);

// - Поставет відповідний оператор в виразах що б вийшов відповідний результат.
//     В однакових виразаї не використовувати однакові оператори!!!
//     5 < 6 -> true
// 5 <= 6 -> false
// 5 === 6 -> false
// 5 < 6 -> false
// 10 === 10 -> true
// 10 >= 10 -> true
// 10 > 10 -> false
// 10 < 10 -> false
// 10 !== 10 -> false
// 123 === '123' -> false
// 123 == '123' -> true

// Додатково:
//     - Подивіться на наступні вирази і спробуйте вгадати яким буде вивід в консоль. Перевірте себе.
// console.log(132 > 100 && 45 < 12 );F
// console.log(34 > 33 && 23 < 90 );T
// console.log(99 > 100 && 45 > 12 );F
// console.log(132 > 100 || 45 < 12 );T
// console.log(111 > 11 || 45 < 111 );T
// console.log((111 > 11 || 45 < 111) && (132 > 100 || 45 < 12) );T
// console.log((111 > 11 || 45 < 56) || (132 > 100 || 45 < 12) );T
// console.log((132 > 100 && 45 < 12 ) && (132 > 100 || 45 < 12 ));T
// console.log((111 > 11 || 45 < 111) || (99 > 100 && 45 > 12 ));
// console.log(!!'-1');true
// console.log(!!-1);true
// console.log(!!'0');true
// console.log(!!'null');true
// console.log(!!'undefined');true
// console.log(!!(3/'owu'));f
// console.log((111 > 11 || 45 < 111) ||  !!'0');t
// console.log((!!111 == !!11 || 45 < 111) && (99 > 100 && 45 > 12 ));f

// ______________________________________________________________________________________________________________________________________________________
// РОБОТА В АУДИТОРІЇ
// ______________________________________________________________________________________________________________________________________________________

// 2. Оголосіть змінні a1, a2, a3, a4, a5. За домогою 3х математичних оператцій отримайте числа:
//     34,
//         12,
//         66,
//         90,
//         87
// Старайтесь використовувати різні оператори.
//     Example: 88 = (16 / 2) * 11
// let a1 = 15;
// let a2 = 6;
// let a3 = 9;
// let a34 = a2*a2-2
// let a12 = 2*a2;
// let a66 = (`${a2}`+`${a2}`);
// let a90 = a1*a2;
// let a87 = Math.pow(9,2) + a2;
// console.log(a34);

// 3.  Створіть змінні a6, a7, a8, a9, a10. Запишіть в них результати виразів:
//     5 % 3,
//     3 % 5,
//     5 + '3',
//     '5' - 3,
//     75 + 'кг'
// let a6 = 5 % 3;
// let a7 = 3 % 5;
// let a8 = 5 + '3';
// let a9 = '5' - 3;
// let a10 = 75 + 'кг';
// console.log(a6,a7,a8,a9,a10);

// 4. Напищіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значееня площі зберігати в змінній s.
// let height = 23;
// let width = 10;
// let s = height*width;
// console.log(s);

// 5.  Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
//     результат поместите в переменную v.
// let heightC = 10;
// let dC = 4;
// let v = heightC*dC;
// console.log(v);

// 6. У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
// Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).
// let n =3;
// let m =4;
// let gip = Math.sqrt(n**2+m**2);
// console.log(gip);

// 7. Напишите скрипт, который выводит "Hello world", создавши переменную str и выводить спомощью document.write, alert и console.log
// function hello(str) {
//     document.write(str);
//     alert(str);
//     console.log(str);
// }
// let a = 'Hello world';
// hello(a);

// 8. Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби (каждой на новой строки спомощью \n).
// alert('kov\nvlad\n21\nswim');

// 9. Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
//     Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
//   Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
//     Вывести в документ содержимое переменной concatenation спомощью document.write
// let str1='who';
// let str2='are';
// let str3='you';
// let concat = str1.concat(str2,str3);
// console.log(concat);

// 10. Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
//     let str = "20";
// let a = 5;
// document.write(str + a + "<br/>");
// document.write(str - a + "<br/>");
// document.write(str * "2" + "<br/>");
// document.write(str / 2 + "<br/>");
//205 15 40 10

// 11. Какие значения выведет в окно консоли следующий фрагмент кода если его поместить в console.log?
//     parseInt("3.14")3
//     parseInt("-7.875")-8
// parseInt("435")435
// let a =parseInt("Вася")//nan

// 12.  С помощью окна ввода, вызываемого методом prompt, пользователь может ввести данные, которые будут использоваться далее, повторите код ниже
// let str = prompt("Enter something", "ho-ho")
// console.log(str);

// 13. С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел, а вывод результата при помощи метода alert
// let a = +prompt('dd');
// let a1 = +prompt('dd');
// alert(a1+a);

// 14. С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя, фамилию и возраст, а вам не обходимо вывести строку такого вида
// Доброго вечера Иван Иванов, мои поздравления что вам 32 , а вывод результата при помощи метода alert
// let name = prompt('name');
// let surname = prompt('surname');
// let age = prompt('age');
// alert(`Доброго вечера ${name} ${surname} , мои поздравления что вам ${age}`);


// =====================
// ======ДОП============
// =====================

// 1. Три різних числа вводяться через prompt().
//     За допомоги if else вивести іх в порядку зростання. (відсортувати по зростанню)
// let arr = [];
// let a = +prompt('Скільки чисел ви хочете ввести?');
// for (let i = 1; i < a+1; i++) {
//     let a1 = +prompt(`число${i}`);
//     arr.push(a1);
// }
// let b =arr.sort((a, b) =>a-b );
// console.log(b);

// 2.  Все параматры получаем с клавиатуры!!!!
//     Имитируем поведение пешехода на перекстке.
//     Если светофор зеленый - вывести "иди".
//     Если светофор желтый - вывести "подожди".
//     Если светофор красный - вывести "стой".
//     Если светофор в аварийном режиме вывести "делай что хочешь"!
// let a = (prompt('Яке світло?').toUpperCase());
// a === 'GREEN' ? console.log('go') : a=== 'YELLOW' ? console.log('wait') : a=== 'RED' ? console.log('stop') : console.log('XZ');

//     3
// Все параметры получаем с клавиатуры!!!!(prompt , confirm)
// Создать переменную isRoadClear которая характеризирует наличие на дороге машин.
//     Улучшаем предыдущее задание.
//     Если светофор зеленый и машин нет - вывести "иди".
//     Если светофор зеленый и машины есть  - вывести подожди пока нарушители проедут".
// Если светофор желтый и машины есть - вывести "жди".
//     Если светофор желтый и машин нет - вывести "все рано жди".
//     Если светофор красный и машин нет- вывести "стой все рано".
//     Если светофор красный - и машины есть вывести "стой и жди".
//     Если светофор в аварийном режиме вывести "делай что хочешь"!
// let a = (prompt('Яке світло?').toUpperCase());
// let b = confirm('Чи є на дорозі машини?');
// if (b === true){
//     a === 'GREEN' ? console.log('подожди пока нарушители проедут') : a=== 'YELLOW' ? console.log('жди') : a=== 'RED' ? console.log('стой и жди') : console.log('XZ');
// }
// else if(b===false){
//     a === 'GREEN' ? console.log('иди') : a=== 'YELLOW' ? console.log('все рано жди') : a=== 'RED' ? console.log('стой все рано') : console.log('XZ');
// }


