// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
// let arr1 = [1,2,3,4,5];
// let arr2 = ['vl','br','hr','qw','xd'];
// let arr3 = ['vl',2,'11',true,54];
// console.log(arr1,arr2,arr3);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let arr =[] ;
// arr[0] ='vlad';
// arr[1] = 25;
// console.log(arr);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// let str = 'vlad';
// for (let i = 0; i < 10; i++) {
//     document.write(`<div>${str}</div>`);
// }

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// let str = 'vlad';
// for (let i = 0; i < 10; i++) {
//     document.write(`<div>${str} + ${i+1}</div>`);
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let i=0;
// while (i<20){
//     document.write(`<h1>VLAD</h1>`);
//     i++;
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let i=0;
// while (i<20){
//     document.write(`<h1>VLAD +${i+1}</h1>`);
//     i++;
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let arr = [1,2,3,4,5,6,7,8,9,10];
// for (const number of arr) {
//     console.log(number);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let arr = ['q','w','a','s','d','f','z','x','c','v'];
// for (const st of arr) {
//     console.log(st);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let arr = ['q',1,'a','2','d',false,'z','x',54,'v'];
// for (const st of arr) {
//     console.log(st);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let arr = ['q',1,'a','2','d',false,'z','x',54,'v'];
// for (let i = 0; i < arr.length; i++) {
//     if (typeof(arr[i]) === "number"){
//         console.log(arr[i]);
//     }
//     // if (typeof(arr[i]) === "string"){
//     //     console.log(arr[i]);
//     // }
//     // if (typeof(arr[i]) === "boolean"){
//     //     console.log(arr[i]);
//     // }
// }

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 10; i++) {
//     console.log(i);
// }

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i++) {
//     console.log(i);
// }

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i=i+2) {
//     console.log(i);
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++) {
//     !(i % 2) ? console.log(i) : i;
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// let i =0;
// while (i<100){
//     (i % 2) ? console.log(i) : i;
//     i++
// }

// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// let a = prompt('Введіть час для таймеру в форматі 00:00:00');
// let b = a.split(':');
// let c = [];
//
// for (let i = 0; i < b.length; i++) {
//     if (b[i].startsWith(0)) {
//         c[i] = b[i] % 10;
//     } else {
//         c[i] = +b[i];
//     }
// }
// for (let hour = 0; hour < 1; hour++) {
//     for (let minutes = 0; minutes < 60; minutes++) {
//         for (let seconds = 0; seconds < 60; seconds++) {
//
//             console.log(hour + ':' + minutes + ':' + seconds);
//             if (hour === c[0] && minutes === c[1] && seconds === c[2]) {
//
//                 console.log(`Кінцевий час ${hour}:${minutes}:${seconds}`);
//                 a = 1;
//                 break;
//             }
//         }
//         if (a === 1) {
//             break;
//         }
//     }
//     if (a === 1) {
//         break;
//     }
// }

// ______________________________________________________________________________________________________________________________________________________
// РОБОТА В АУДИТОРІЇ
// ______________________________________________________________________________________________________________________________________________________
//

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// let arr = ['a', 'b', 'c'];
// for (let i = 1; i < 4; i++) {
//     arr.push(i);
// }
// console.log(arr);

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// let arr =[1, 2, 3];
// let arr1 = arr.sort((a, b) => b-a);
// console.log(arr1);

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// let arr =[1, 2, 3];
// for (let i = 4; i < 7; i++) {
//     arr.push(i);
// }
// console.log(arr);

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// let arr =[1, 2, 3];
// for (let i = 6; i > 3; i--) {
//     arr.unshift(i);
// }
// console.log(arr);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// let arr = ['js', 'css', 'jq'];
// let a = arr.pop();
// let b =arr.shift();
// console.log(a,b);

// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
// let arr = [1, 2, 3, 4, 5];
// arr.splice(0,3);
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
// let arr = [1, 2, 3, 4, 5];
// arr.splice(2,3);
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//     Підказка. Необхідно стерти елементи, зберегти їх кудись. Дописати букви і після букв повернути стерті цифри
// let arr = [1, 2, 3, 4, 5];
// arr.splice(3,0,'a','b','c');
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//     Підказка. Працюйте по принципу задачі вище.
// let arr = [1, 2, 3, 4, 5];
// arr.splice(1,0,'a','b');
// arr.splice(6,0,'c');
// arr.splice(8,0,'e');
// console.log(arr);

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// let arr = [234,63,13,6,8,42,68,94,11,87];
// let b = arr.filter(value => !(value%2));
// console.log(b);

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
// За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// let arr = [234,63,13,6,8,42,68,94,11,87];
// let arr1 =[];
// for (let i = 0; i < arr.length; i++) {
//     arr1.push(arr[i]);
// }
// console.log(arr1);

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
// За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
// let arr = [234,63,13,6,8,42,68,94,11,87];
// let arr1 = [];
// for (let i = 0; i < arr.length; i++) {
//     arr1[i]=arr[i];
// }
// console.log(arr1);

//
// ============
//

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while (i<arr.length){
//     console.log(arr[i]);
//     i++;
// }

//     2. перебрати його циклом for
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (const number of arr) {
//     console.log(number);
// }

//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
//     4. перебрати циклом for та вивести  числа тільки з непарним індексом
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while (i<arr.length){
//     if(i%2){
//         console.log(arr[i]);
//     }
//     i++
// }
// for (let j = 0; j < arr.length; j++) {
//     if(j%2){
//         console.log(arr[j]);
//     }
// }
// let b = arr.filter((value, index) => index%2);
// console.log(b);

// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while (i<arr.length){
//     if(!(arr[i]%2)){
//         console.log(arr[i]);
//     }
//     i++
// }
// for (let j = 0; j < arr.length; j++) {
//     if(!(arr[j]%2)){
//         console.log(arr[j]);
//     }
// }
// let b = arr.filter((value, index) => !(value%2));
// console.log(b);

// 7. замінити кожне число кратне 3 на слово "okten"
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i]%3 === 0 ){
//         arr[i] = 'okten';
//     }
// }
// console.log(arr);

// 8. вивести масив в зворотньому порядку.
//  let arr = [2,17,13,6,22,31,45,66,100,-18];
// console.log(arr.reverse());

// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//     let arr = [];
// for (let i = 0; i < 50; i++) {
//     arr[i]=i*2;
// }
// console.log(arr);
// let arr1 = [];
// for (let i = 0; i < 50; i++) {
//     arr1[i]=i*2+1;
// }
// console.log(arr1);

//
// 1. Створити пустий масив та :
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
//
// let arr = [];
// for (let i = 0; i < 20; i++) {
//     arr[i] =Math.round(Math.random() * (732 - 8)) + 8;
// }
// console.log(arr);

// 2. Вивести за допомогою console.log кожен третій елемен
// let b =arr.filter(value => !(value%3));
// console.log(b);

// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
// let c = arr.filter((value, index) => {
//     if ((index+1)%3 === 0){
//         if(value%2===0){
//             return value;
//         }
//     }
// })
// console.log(c);

// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив4
// let arrg = [];
// let i = 0;
// arr.forEach((value, index) => {
//     if ((index+1)%3 === 0){
//         if(value%2===0){
//             arrg[i]=value;
//             i++;
//         }
//     }
// })
// console.log(arrg);

// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
// let h = arr.reduce((acc, currentValue) => {
//     if (currentValue%2===0){
//         console.log(acc);
//     }
//     return currentValue;
// });
// console.log(h);

// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
// let arr = [100,250,50,168,120,345,188];
// let h = arr.reduce((previousValue, currentValue, currentIndex, array) => {
//     return previousValue +currentValue;
// });
// console.log(h/arr.length);

// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// let arr = [];
// for (let i = 0; i < 20; i++) {
//     arr[i] =Math.round(Math.random() * (100 - 1)) + 1;
// }
// let x5 = arr.map(value => value*5);
// console.log(arr);
// console.log(x5);

// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...).
// пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
// let arr = ['false','35566',3,'31',5,'va',7,'ve',9,true];
// let arrnum = arr.filter(value => typeof(value)==='number');
// console.log(arrnum);

//     ______________________________________________________________________________________________________________________________________________________
// Додатково
// ______________________________________________________________________________________________________________________________________________________
//

// let arr = ['a','b','c'];
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// let b = '';
// for (const string of arr) {
//      b += string;
// }
// console.log(b);
//
// let c = arr.join('');
// console.log(c);
//
// let i = 0;
// let h ='';
// while (i<arr.length){
//     h+=arr[i];
//     i++;
// }
// console.log(h);
//
// let p = '';
// for (let j = 0; j < arr.length; j++) {
//     p+=arr[j];
// }
// console.log(p);